{
    "Heroes & Generals": {
        "avatar": "Musket",
        "country": "DK",
        "language": {
            "AT": {
                "text": "Heroes & Generals ist ein Online-Ego-Shooter des dänischen Studios Reto-Moto. Das Spiel ist im Zweiten Weltkrieg angesiedelt und bietet derzeit drei Fraktionen: die UdSSR, Deutschland und die USA. Mit einem einzigen Account kann man gleichzeitig alle drei Fraktionen spielen und jederzeit den gewünschten Soldaten auswählen. Zu Beginn des Spiels steht nur ein einfacher Infanterist zur Verfügung. Mit steigendem Rang werden weitere Klassen freigeschaltet: Panzerfahrer, Pilot, Fallschirmjäger, Aufklärer (Scharfschütze) und General. Ein Klassenwechsel ist unwiderruflich. Ein Soldat kann also nur eine Klasse haben; man kann beispielsweise nicht gleichzeitig Panzerfahrer und Pilot sein. Ansonsten können die Spieler frei wählen, was ihnen gefällt und am besten zu ihrem Spielstil passt. Spielprinzip: Heroes & Generals ist ein rundenbasierter Shooter. In jeder Runde besteht das Hauptziel darin, Kontrollpunkte zu halten. Das Töten von Gegnern ist also nicht das primäre Ziel. Es ist wichtig zu wissen, dass das Erobern von Punkten an eine bestimmte Reihenfolge gebunden ist. Dies wird sofort deutlich, wenn man sich die Karte ansieht. Sobald ein Team einen ganzen Punktezweig erobert hat, können Gegner in dieser Richtung nicht mehr erscheinen, was in der Regel zum Sieg führt. Die Schauplätze im Spiel unterscheiden sich nicht nur in ihrer Größe, sondern auch in den jeweils verfügbaren Fahrzeugtypen. Es gibt beispielsweise Gebiete ausschließlich für Infanterie, Gebiete mit Panzern und sogar größere Gebiete, in denen auch Flugzeuge verfügbar sind. Die Steuerung eines bestimmten Fahrzeugtyps erfordert eine bestimmte Klasse. Spielt man beispielsweise als Panzerfahrer, beginnt man das Spiel in einem Panzer. Anfangs stehen einfachere Fahrzeuge zur Verfügung, nach und nach kann man jedoch fortgeschrittenere freischalten. Jeder Soldat verfügt über ein Standardwaffenset, durch das Levelsystem lassen sich neue Waffen freischalten und verbessern. Es gibt relativ wenige Waffen im Spiel, aber jede hat ihre eigenen Vorteile. Anders ausgedrückt: Es gibt praktisch keine schlechten Waffen. Neben kleineren Scharmützeln an verschiedenen Orten bietet das Spiel eine Weltkarte, auf der der Krieg stattfindet. Das bedeutet, dass jeder Spieler die Lage seiner Fraktion beeinflussen und somit den Lauf der Geschichte verändern kann."
            },
            "BE": {
                "text": "Heroes & Generals est un jeu de tir à la première personne en ligne développé par le studio danois Reto-Moto. Le jeu se déroule pendant la Seconde Guerre mondiale. Actuellement, il propose trois factions : l'URSS, l'Allemagne et les États-Unis. Un seul compte permet de jouer simultanément avec les trois factions et de choisir son soldat à tout moment. Au début, vous ne pouvez incarner qu'un simple fantassin, mais en progressant dans la hiérarchie, plusieurs classes supplémentaires se débloquent : tankiste, pilote, parachutiste, éclaireur (tireur d'élite) et général. Attention : si vous changez de classe, il est impossible de revenir en arrière. Un soldat ne peut donc appartenir qu'à une seule classe ; par exemple, il est impossible d'être à la fois tankiste et pilote. Pour le reste, les joueurs sont libres de choisir ce qui leur plaît et correspond le mieux à leur style de jeu. Le gameplay de Heroes & Generals est basé sur des sessions, et dans chaque partie, l'objectif principal est de contrôler des points stratégiques. L'élimination des ennemis n'est donc pas le but premier. Il est important de se rappeler que la capture de points est strictement limitée à une séquence précise. Cela deviendra immédiatement évident en consultant la carte. Lorsqu'une équipe capture une branche entière de points, les ennemis dans cette direction ne peuvent plus réapparaître, ce qui mène généralement à la victoire. Les zones du jeu varient non seulement en taille, mais aussi en types de véhicules disponibles. Par exemple, certaines sont exclusivement réservées à l'infanterie, d'autres aux chars, et d'autres encore plus vastes où l'on trouve même des avions. Piloter un type de véhicule spécifique requiert une classe spécifique. Ainsi, si vous jouez un tankiste, vous commencerez la partie aux commandes d'un char. Au départ, vous aurez accès à des véhicules plus simples, mais vous pourrez progressivement débloquer des modèles plus avancés. Chaque soldat dispose d'un arsenal standard, mais grâce au système de niveaux, vous pouvez débloquer de nouvelles armes et les améliorer. Le nombre d'armes est relativement faible, mais chacune possède ses propres avantages. En d'autres termes, il n'y a pratiquement pas de mauvaises armes. Outre des escarmouches ponctuelles en divers lieux, le jeu propose une carte du monde où se déroule la guerre. Ainsi, chaque joueur peut influencer le sort de sa faction et, en quelque sorte, changer le cours de l'histoire."
            },
            "BG": {
                "text": "Heroes & Generals е онлайн шутър от първо лице, разработен от датското студио Reto-Moto. Играта е посветена на Втората световна война. В момента играта включва три фракции: СССР, Германия и САЩ. Един акаунт може едновременно да играе и за трите фракции и да избира войника, който иска, по всяко време. В началото на играта можете да играете само като стандартен пехотинец, но с напредването си в редиците ще се отключат още няколко класа: танкист, пилот, парашутист, разузнавач и генерал. Ако внезапно решите да промените класа си на пехота, не забравяйте, че няма връщане назад. Това означава, че един войник може да има само един клас; например, не можете да бъдете едновременно танкист и пилот. В противен случай играчите са свободни да избират какво харесват и какво най-добре отговаря на техния стил на игра. Геймплей: Heroes & Generals е шутър, базиран на сесии, и във всеки мач основната цел е да се задържат контролни точки. Тоест, убиването на врагове не е основната цел. Важно е да се помни, че превземането на точки е строго ограничено до определена последователност. Това ще стане веднага очевидно, когато погледнете цялостната карта. Когато един отбор превземе цял клон от точки, враговете в тази посока вече не могат да се преродят, което обикновено води до евентуална победа. Локациите в играта варират не само по размер, но и по видовете превозни средства, налични в дадения момент. Например, има локации изключително за пехота, локации с танкове и дори по-големи локации, където дори са налични самолети. Контролирането на определен тип превозно средство изисква определен клас. Така например, ако играете като танкер, ще започнете играта с танк. Първоначално ще имате достъп до по-прости превозни средства, но постепенно ще можете да отключвате по-модерни. Всеки войник има стандартен набор от оръжия, но чрез системата за нивелиране можете да отключвате нови оръжия и да ги повишавате. В играта има сравнително малко оръжия, но всяко има своите предимства. С други думи, практически няма лоши оръжия. В допълнение към малки схватки на различни локации, играта разполага с глобална карта, където се води войната. Това означава, че всеки играч може да повлияе на състоянието на делата на своята фракция и, така да се каже, да промени хода на историята."
            },
            "BR": {
                "text": "Heroes & Generals é um jogo de tiro em primeira pessoa online desenvolvido pelo estúdio dinamarquês Reto-Moto. O jogo é ambientado na Segunda Guerra Mundial. Atualmente, o jogo apresenta três facções: URSS, Alemanha e EUA. Uma única conta pode jogar simultaneamente com as três facções e selecionar o soldado que desejar a qualquer momento. No início do jogo, você só pode jogar como um soldado de infantaria padrão, mas à medida que avança nas patentes, várias outras classes serão desbloqueadas: tanqueiro, piloto, paraquedista, batedor (atirador de elite) e general. Se você decidir mudar de classe de infantaria, lembre-se de que não há como voltar atrás. Isso significa que um soldado só pode ter uma classe; por exemplo, você não pode ser tanqueiro e piloto ao mesmo tempo. Fora isso, os jogadores são livres para escolher o que gostam e o que melhor se adapta ao seu estilo de jogo. Jogabilidade: Heroes & Generals é um jogo de tiro baseado em sessões, e em cada partida, o objetivo principal é manter pontos de controle. Ou seja, matar inimigos não é o objetivo principal. É importante lembrar que a captura de pontos é estritamente limitada a uma sequência específica. Isso ficará imediatamente evidente ao observar o mapa geral. Quando uma equipe captura um conjunto inteiro de pontos, os inimigos nessa direção não podem mais reaparecer, o que geralmente leva à vitória. Os locais no jogo variam não apenas em tamanho, mas também nos tipos de veículos disponíveis em determinado momento. Por exemplo, existem locais exclusivos para infantaria, locais com tanques e locais ainda maiores onde até mesmo aeronaves estão disponíveis. Controlar um tipo específico de veículo requer uma classe específica. Então, por exemplo, se você jogar como um tanqueiro, começará o jogo em um tanque. Inicialmente, você terá acesso a veículos mais simples, mas gradualmente poderá desbloquear veículos mais avançados. Cada soldado possui um conjunto padrão de armas, mas através do sistema de níveis, você pode desbloquear novas armas e aprimorá-las. Existem relativamente poucas armas no jogo, mas cada uma tem suas próprias vantagens. Em outras palavras, praticamente não existem armas ruins. Além de pequenas escaramuças em vários locais, o jogo apresenta um mapa global onde a guerra está acontecendo. Isso significa que cada jogador pode influenciar a situação de sua facção e, por assim dizer, mudar o curso da história."
            },
            "BY": {
                "text": "Heroes & Generals - гэта онлайн гульня ў жанры шутэра ад першай асобы, распрацаваная дацкай студыяй Reto-Moto. Тэматыкай гульні з'яўляецца Другая сусветная вайна. На бягучы момант у гульні прадстаўлены 3 бакі: СССР, Германія і ЗША. На адным акаўнце адначасова можна развіваць усе 3 бакі і ў любы момант выбіраць патрэбнага вам салдата. У самым пачатку гульні можна будзе гуляць толькі за звычайнага пяхотніка, але прасоўваючыся па кар'ернай лесвіцы, адкрыюцца яшчэ некалькі класаў: танкіст, лётчык, дэсантнік (парашутыст), разведчык (снайпер) і генерал. Калі вы раптам вырашыце змяніць клас пяхотніка, тое трэба памятаць аб тым, што шляхі назад ужо не будзе. Гэта значыць адзін салдат можа мець толькі адзін клас і нельга быць адначасова напрыклад танкістам і лётчыкам. У астатнім жа гулец вольны выбіраць тое, што яму падабаецца і што лепш за ўсё падыходзіць пад яго стыль гульні. Гульнявы ​​працэс. Heroes & Generals з'яўляецца сесійным шутэрам і ў кожным з матчаў асноўнай задачай з'яўляецца ўтрыманне кантрольных кропак. Гэта значыць, забойства ворагаў не стаіць на першым месцы. Пры гэтым трэба ўлічваць, што захопліваць кропкі можна ў строгай паслядоўнасці. Гэта вы адразу зразумееце, калі звернеце ўвагу на агульную карту. Калі адна з каманд захоплівае цэлую галінку з кропак, то ў гэтым напрамку ворагі ўжо не змогуць уваскрашацца і звычайна гэта паступова прыводзіць да перамогі. Лакацыі ў гульні адрозніваюцца не толькі па памеры, але і па тым, які від тэхнікі даступны ў дадзены момант. Ёсць напрыклад лакацыі толькі для пяхоты, ёсць лакацыі з танкамі, а ёсць вялікія лакацыі, дзе даступныя нават самалёты. Для кіравання пэўным відам тэхнікі спатрэбіцца спецыяльны клас. Гэта значыць, напрыклад, гуляючы за танкіста вы будзеце пачынаць гульню на танку. Спачатку будуць даступныя простыя віды тэхнікі, але паступова можна будзе адкрыць больш сур'ёзныя віды машын. У кожнага байца ёсць стандартны набор зброі, але за кошт сістэмы прапампоўкі можна адкрыць новыя віды зброі, а таксама іх прапампаваць. У гульні параўнальна крыху зброі, але кожнае мае свае станоўчыя якасці. Гэта значыць дрэннай зброі практычна няма. Апроч невялікіх сутычак на розных лакацыях, у гульні ёсць глабальная карта, дзе ідзе вайна. Гэта значыць кожны гулец можа ўплываць на становішча спраў сваёй фракцыі і памяняць ход гісторыі."
            },
            "CL": {
                "text": "Heroes & Generals es un juego de disparos en primera persona online desarrollado por el estudio danés Reto-Moto. La temática del juego gira en torno a la Segunda Guerra Mundial. Actualmente, cuenta con tres facciones: la URSS, Alemania y EE. UU. Una sola cuenta puede jugar simultáneamente con las tres facciones y seleccionar el soldado que desee en cualquier momento. Al principio, solo puedes jugar como soldado de infantería estándar, pero a medida que subes de rango, se desbloquearán varias clases más: tanquista, piloto, paracaidista, explorador y general. Si decides cambiar de clase de infantería repentinamente, recuerda que no hay vuelta atrás. Esto significa que un soldado solo puede tener una clase; por ejemplo, no puedes ser tanquista y piloto a la vez. De lo contrario, los jugadores son libres de elegir lo que prefieran y se adapte mejor a su estilo de juego. Jugabilidad: Heroes & Generals es un juego de disparos por sesiones, y en cada partida, el objetivo principal es mantener los puntos de control. Es decir, matar enemigos no es el objetivo principal. Es importante recordar que la captura de puntos está estrictamente limitada a una secuencia específica. Esto se hará evidente al observar el mapa general. Cuando un equipo captura una rama completa de puntos, los enemigos en esa dirección ya no pueden reaparecer, lo que generalmente conduce a la victoria. Las ubicaciones del juego varían no solo en tamaño, sino también en los tipos de vehículos disponibles en cada momento. Por ejemplo, hay ubicaciones exclusivas para infantería, ubicaciones con tanques e incluso ubicaciones más grandes donde incluso hay aviones disponibles. Controlar un tipo específico de vehículo requiere una clase específica. Por ejemplo, si juegas como tanquista, comenzarás la partida en un tanque. Inicialmente, tendrás acceso a vehículos más sencillos, pero gradualmente podrás desbloquear vehículos más avanzados. Cada soldado tiene un conjunto de armas estándar, pero mediante el sistema de niveles, puedes desbloquear nuevas armas y subirlas de nivel. Hay relativamente pocas armas en el juego, pero cada una tiene sus propias ventajas. En otras palabras, prácticamente no hay armas malas. Además de pequeñas escaramuzas en diversos lugares, el juego cuenta con un mapa global donde se desarrolla la guerra. Esto significa que cada jugador puede influir en la situación de su facción y, por así decirlo, cambiar el curso de la historia."
            },
            "CN": {
                "text": "《英雄与将军》（Heroes & Generals）是一款由丹麦工作室Reto-Moto开发的在线第一人称射击游戏，以二战为背景。目前，游戏包含苏联、德国和美国三个阵营。一个账号可以同时扮演所有三个阵营，并随时选择自己喜欢的士兵。游戏初期，玩家只能扮演普通步兵，但随着等级提升，可以解锁更多兵种：坦克兵、飞行员、伞兵、侦察兵（狙击手）和将军。如果您突然决定更换步兵兵种，请记住无法更改。这意味着一名士兵只能选择一个兵种；例如，您不能同时是坦克兵和飞行员。除此之外，玩家可以自由选择自己喜欢且最适合自己游戏风格的兵种。游戏玩法：《英雄与将军》是一款基于回合制的射击游戏，每场比赛的主要目标是占领控制点。也就是说，击杀敌人并非首要目标。务必记住，占领据点必须严格按照特定顺序进行。查看总地图后，这一点会立刻显现出来。当一方占领一整条据点带后，该方向的敌人将无法重生，这通常意味着最终的胜利。游戏中的地点不仅大小各异，可用的载具类型也多种多样。例如，有些地点仅限步兵使用，有些地点配备坦克，甚至还有更大的地点可以驾驶飞机。操控特定类型的载具需要特定的职业。例如，如果你选择坦克兵职业，游戏开始时你将驾驶坦克。初期你只能使用较为简单的载具，但随着游戏进程，你将逐步解锁更高级的载具。每位士兵都配备一套标准武器，但通过升级系统，你可以解锁新武器并提升其等级。游戏中的武器种类相对较少，但每种武器都有其独特的优势。换句话说，游戏中几乎没有不好的武器。除了在各地发生的零星冲突外，游戏还包含一张全球地图，战争就发生在这张地图上。这意味着每位玩家都可以影响自己阵营的局势，并可以说，改变历史的进程。"
            },
            "CY": {
                "text": "Το Heroes & Generals είναι ένα online παιχνίδι σκοποβολής πρώτου προσώπου που αναπτύχθηκε από το δανέζικο στούντιο Reto-Moto. Το παιχνίδι έχει θέμα τον Δεύτερο Παγκόσμιο Πόλεμο. Προς το παρόν, το παιχνίδι περιλαμβάνει τρεις παρατάξεις: την ΕΣΣΔ, τη Γερμανία και τις ΗΠΑ. Ένας μόνο λογαριασμός μπορεί να παίξει ταυτόχρονα και με τις τρεις παρατάξεις και να επιλέξει τον στρατιώτη που θέλει ανά πάσα στιγμή. Στην αρχή του παιχνιδιού, μπορείτε να παίξετε μόνο ως τυπικός πεζικός, αλλά καθώς προχωράτε στις τάξεις, θα ξεκλειδωθούν αρκετές ακόμη κλάσεις: τανκ, πιλότος, αλεξιπτωτιστής (αλεξίπτωτο), ανιχνευτής (ελεύθερος σκοπευτής) και στρατηγός. Εάν ξαφνικά αποφασίσετε να αλλάξετε την κλάση πεζικού σας, θυμηθείτε ότι δεν υπάρχει επιστροφή. Αυτό σημαίνει ότι ένας στρατιώτης μπορεί να έχει μόνο μία κλάση. για παράδειγμα, δεν μπορείτε να είστε και τανκ και πιλότος. Διαφορετικά, οι παίκτες είναι ελεύθεροι να επιλέξουν τι τους αρέσει και τι ταιριάζει καλύτερα στο στυλ παιχνιδιού τους. Τρόπος παιχνιδιού: Το Heroes & Generals είναι ένα παιχνίδι σκοποβολής που βασίζεται σε συνεδρίες και σε κάθε αγώνα, ο κύριος στόχος είναι η διατήρηση σημείων ελέγχου. Δηλαδή, η θανάτωση εχθρών δεν είναι ο πρωταρχικός στόχος. Είναι σημαντικό να θυμάστε ότι η κατάκτηση πόντων περιορίζεται αυστηρά σε μια συγκεκριμένη ακολουθία. Αυτό θα γίνει αμέσως εμφανές όταν κοιτάξετε τον συνολικό χάρτη. Όταν μια ομάδα κατακτήσει έναν ολόκληρο κλάδο σημείων, οι εχθροί προς αυτήν την κατεύθυνση δεν μπορούν πλέον να αναδυθούν, κάτι που συνήθως οδηγεί σε τελική νίκη. Οι τοποθεσίες στο παιχνίδι ποικίλλουν όχι μόνο σε μέγεθος αλλά και στους τύπους οχημάτων που είναι διαθέσιμα τη δεδομένη στιγμή. Για παράδειγμα, υπάρχουν τοποθεσίες αποκλειστικά για πεζικό, τοποθεσίες με άρματα μάχης και ακόμη μεγαλύτερες τοποθεσίες όπου είναι διαθέσιμα ακόμη και αεροσκάφη. Ο έλεγχος ενός συγκεκριμένου τύπου οχήματος απαιτεί μια συγκεκριμένη κλάση. Έτσι, για παράδειγμα, αν παίζετε ως τανκ, θα ξεκινήσετε το παιχνίδι σε ένα τανκ. Αρχικά, θα έχετε πρόσβαση σε απλούστερα οχήματα, αλλά σταδιακά θα μπορείτε να ξεκλειδώσετε πιο προηγμένα. Κάθε στρατιώτης έχει ένα τυπικό σετ όπλων, αλλά μέσω του συστήματος ισοπέδωσης, μπορείτε να ξεκλειδώσετε νέα όπλα και να τα αναβαθμίσετε. Υπάρχουν σχετικά λίγα όπλα στο παιχνίδι, αλλά το καθένα έχει τα δικά του πλεονεκτήματα. Με άλλα λόγια, ουσιαστικά δεν υπάρχουν κακά όπλα. Εκτός από μικρές αψιμαχίες σε διάφορες τοποθεσίες, το παιχνίδι διαθέτει έναν παγκόσμιο χάρτη όπου λαμβάνει χώρα ο πόλεμος. Αυτό σημαίνει ότι κάθε παίκτης μπορεί να επηρεάσει την κατάσταση της παράταξής του και, ας πούμε, να αλλάξει την πορεία της ιστορίας."
            },
            "DD": {
                "text": "Heroes & Generals ist ein Online-Ego-Shooter des dänischen Studios Reto-Moto. Das Spiel ist im Zweiten Weltkrieg angesiedelt und bietet derzeit drei Fraktionen: die UdSSR, Deutschland und die USA. Mit einem einzigen Account kann man gleichzeitig alle drei Fraktionen spielen und jederzeit den gewünschten Soldaten auswählen. Zu Beginn des Spiels steht nur ein einfacher Infanterist zur Verfügung. Mit steigendem Rang werden weitere Klassen freigeschaltet: Panzerfahrer, Pilot, Fallschirmjäger, Aufklärer (Scharfschütze) und General. Ein Klassenwechsel ist unwiderruflich. Ein Soldat kann also nur eine Klasse haben; man kann beispielsweise nicht gleichzeitig Panzerfahrer und Pilot sein. Ansonsten können die Spieler frei wählen, was ihnen gefällt und am besten zu ihrem Spielstil passt. Spielprinzip: Heroes & Generals ist ein rundenbasierter Shooter. In jeder Runde besteht das Hauptziel darin, Kontrollpunkte zu halten. Das Töten von Gegnern ist also nicht das primäre Ziel. Es ist wichtig zu wissen, dass das Erobern von Punkten an eine bestimmte Reihenfolge gebunden ist. Dies wird sofort deutlich, wenn man sich die Karte ansieht. Sobald ein Team einen ganzen Punktezweig erobert hat, können Gegner in dieser Richtung nicht mehr erscheinen, was in der Regel zum Sieg führt. Die Schauplätze im Spiel unterscheiden sich nicht nur in ihrer Größe, sondern auch in den jeweils verfügbaren Fahrzeugtypen. Es gibt beispielsweise Gebiete ausschließlich für Infanterie, Gebiete mit Panzern und sogar größere Gebiete, in denen auch Flugzeuge verfügbar sind. Die Steuerung eines bestimmten Fahrzeugtyps erfordert eine bestimmte Klasse. Spielt man beispielsweise als Panzerfahrer, beginnt man das Spiel in einem Panzer. Anfangs stehen einfachere Fahrzeuge zur Verfügung, nach und nach kann man jedoch fortgeschrittenere freischalten. Jeder Soldat verfügt über ein Standardwaffenset, durch das Levelsystem lassen sich neue Waffen freischalten und verbessern. Es gibt relativ wenige Waffen im Spiel, aber jede hat ihre eigenen Vorteile. Anders ausgedrückt: Es gibt praktisch keine schlechten Waffen. Neben kleineren Scharmützeln an verschiedenen Orten bietet das Spiel eine Weltkarte, auf der der Krieg stattfindet. Das bedeutet, dass jeder Spieler die Lage seiner Fraktion beeinflussen und somit den Lauf der Geschichte verändern kann."
            },
            "DE": {
                "text": "Heroes & Generals ist ein Online-Ego-Shooter des dänischen Studios Reto-Moto. Das Spiel ist im Zweiten Weltkrieg angesiedelt und bietet derzeit drei Fraktionen: die UdSSR, Deutschland und die USA. Mit einem einzigen Account kann man gleichzeitig alle drei Fraktionen spielen und jederzeit den gewünschten Soldaten auswählen. Zu Beginn des Spiels steht nur ein einfacher Infanterist zur Verfügung. Mit steigendem Rang werden weitere Klassen freigeschaltet: Panzerfahrer, Pilot, Fallschirmjäger, Aufklärer (Scharfschütze) und General. Ein Klassenwechsel ist unwiderruflich. Ein Soldat kann also nur eine Klasse haben; man kann beispielsweise nicht gleichzeitig Panzerfahrer und Pilot sein. Ansonsten können die Spieler frei wählen, was ihnen gefällt und am besten zu ihrem Spielstil passt. Spielprinzip: Heroes & Generals ist ein rundenbasierter Shooter. In jeder Runde besteht das Hauptziel darin, Kontrollpunkte zu halten. Das Töten von Gegnern ist also nicht das primäre Ziel. Es ist wichtig zu wissen, dass das Erobern von Punkten an eine bestimmte Reihenfolge gebunden ist. Dies wird sofort deutlich, wenn man sich die Karte ansieht. Sobald ein Team einen ganzen Punktezweig erobert hat, können Gegner in dieser Richtung nicht mehr erscheinen, was in der Regel zum Sieg führt. Die Schauplätze im Spiel unterscheiden sich nicht nur in ihrer Größe, sondern auch in den jeweils verfügbaren Fahrzeugtypen. Es gibt beispielsweise Gebiete ausschließlich für Infanterie, Gebiete mit Panzern und sogar größere Gebiete, in denen auch Flugzeuge verfügbar sind. Die Steuerung eines bestimmten Fahrzeugtyps erfordert eine bestimmte Klasse. Spielt man beispielsweise als Panzerfahrer, beginnt man das Spiel in einem Panzer. Anfangs stehen einfachere Fahrzeuge zur Verfügung, nach und nach kann man jedoch fortgeschrittenere freischalten. Jeder Soldat verfügt über ein Standardwaffenset, durch das Levelsystem lassen sich neue Waffen freischalten und verbessern. Es gibt relativ wenige Waffen im Spiel, aber jede hat ihre eigenen Vorteile. Anders ausgedrückt: Es gibt praktisch keine schlechten Waffen. Neben kleineren Scharmützeln an verschiedenen Orten bietet das Spiel eine Weltkarte, auf der der Krieg stattfindet. Das bedeutet, dass jeder Spieler die Lage seiner Fraktion beeinflussen und somit den Lauf der Geschichte verändern kann."
            },
            "DR": {
                "text": "Heroes & Generals ist ein Online-Ego-Shooter des dänischen Studios Reto-Moto. Das Spiel ist im Zweiten Weltkrieg angesiedelt und bietet derzeit drei Fraktionen: die UdSSR, Deutschland und die USA. Mit einem einzigen Account kann man gleichzeitig alle drei Fraktionen spielen und jederzeit den gewünschten Soldaten auswählen. Zu Beginn des Spiels steht nur ein einfacher Infanterist zur Verfügung. Mit steigendem Rang werden weitere Klassen freigeschaltet: Panzerfahrer, Pilot, Fallschirmjäger, Aufklärer (Scharfschütze) und General. Ein Klassenwechsel ist unwiderruflich. Ein Soldat kann also nur eine Klasse haben; man kann beispielsweise nicht gleichzeitig Panzerfahrer und Pilot sein. Ansonsten können die Spieler frei wählen, was ihnen gefällt und am besten zu ihrem Spielstil passt. Spielprinzip: Heroes & Generals ist ein rundenbasierter Shooter. In jeder Runde besteht das Hauptziel darin, Kontrollpunkte zu halten. Das Töten von Gegnern ist also nicht das primäre Ziel. Es ist wichtig zu wissen, dass das Erobern von Punkten an eine bestimmte Reihenfolge gebunden ist. Dies wird sofort deutlich, wenn man sich die Karte ansieht. Sobald ein Team einen ganzen Punktezweig erobert hat, können Gegner in dieser Richtung nicht mehr erscheinen, was in der Regel zum Sieg führt. Die Schauplätze im Spiel unterscheiden sich nicht nur in ihrer Größe, sondern auch in den jeweils verfügbaren Fahrzeugtypen. Es gibt beispielsweise Gebiete ausschließlich für Infanterie, Gebiete mit Panzern und sogar größere Gebiete, in denen auch Flugzeuge verfügbar sind. Die Steuerung eines bestimmten Fahrzeugtyps erfordert eine bestimmte Klasse. Spielt man beispielsweise als Panzerfahrer, beginnt man das Spiel in einem Panzer. Anfangs stehen einfachere Fahrzeuge zur Verfügung, nach und nach kann man jedoch fortgeschrittenere freischalten. Jeder Soldat verfügt über ein Standardwaffenset, durch das Levelsystem lassen sich neue Waffen freischalten und verbessern. Es gibt relativ wenige Waffen im Spiel, aber jede hat ihre eigenen Vorteile. Anders ausgedrückt: Es gibt praktisch keine schlechten Waffen. Neben kleineren Scharmützeln an verschiedenen Orten bietet das Spiel eine Weltkarte, auf der der Krieg stattfindet. Das bedeutet, dass jeder Spieler die Lage seiner Fraktion beeinflussen und somit den Lauf der Geschichte verändern kann."
            },
            "ES": {
                "text": "Heroes & Generals es un juego de disparos en primera persona online desarrollado por el estudio danés Reto-Moto. La temática del juego gira en torno a la Segunda Guerra Mundial. Actualmente, cuenta con tres facciones: la URSS, Alemania y EE. UU. Una sola cuenta puede jugar simultáneamente con las tres facciones y seleccionar el soldado que desee en cualquier momento. Al principio, solo puedes jugar como soldado de infantería estándar, pero a medida que subes de rango, se desbloquearán varias clases más: tanquista, piloto, paracaidista, explorador y general. Si decides cambiar de clase de infantería repentinamente, recuerda que no hay vuelta atrás. Esto significa que un soldado solo puede tener una clase; por ejemplo, no puedes ser tanquista y piloto a la vez. De lo contrario, los jugadores son libres de elegir lo que prefieran y se adapte mejor a su estilo de juego. Jugabilidad: Heroes & Generals es un juego de disparos por sesiones, y en cada partida, el objetivo principal es mantener los puntos de control. Es decir, matar enemigos no es el objetivo principal. Es importante recordar que la captura de puntos está estrictamente limitada a una secuencia específica. Esto se hará evidente al observar el mapa general. Cuando un equipo captura una rama completa de puntos, los enemigos en esa dirección ya no pueden reaparecer, lo que generalmente conduce a la victoria. Las ubicaciones del juego varían no solo en tamaño, sino también en los tipos de vehículos disponibles en cada momento. Por ejemplo, hay ubicaciones exclusivas para infantería, ubicaciones con tanques e incluso ubicaciones más grandes donde incluso hay aviones disponibles. Controlar un tipo específico de vehículo requiere una clase específica. Por ejemplo, si juegas como tanquista, comenzarás la partida en un tanque. Inicialmente, tendrás acceso a vehículos más sencillos, pero gradualmente podrás desbloquear vehículos más avanzados. Cada soldado tiene un conjunto de armas estándar, pero mediante el sistema de niveles, puedes desbloquear nuevas armas y subirlas de nivel. Hay relativamente pocas armas en el juego, pero cada una tiene sus propias ventajas. En otras palabras, prácticamente no hay armas malas. Además de pequeñas escaramuzas en diversos lugares, el juego cuenta con un mapa global donde se desarrolla la guerra. Esto significa que cada jugador puede influir en la situación de su facción y, por así decirlo, cambiar el curso de la historia."
            },
            "FR": {
                "text": "Heroes & Generals est un jeu de tir à la première personne en ligne développé par le studio danois Reto-Moto. Le jeu se déroule pendant la Seconde Guerre mondiale. Actuellement, il propose trois factions : l'URSS, l'Allemagne et les États-Unis. Un seul compte permet de jouer simultanément avec les trois factions et de choisir son soldat à tout moment. Au début, vous ne pouvez incarner qu'un simple fantassin, mais en progressant dans la hiérarchie, plusieurs classes supplémentaires se débloquent : tankiste, pilote, parachutiste, éclaireur (tireur d'élite) et général. Attention : si vous changez de classe, il est impossible de revenir en arrière. Un soldat ne peut donc appartenir qu'à une seule classe ; par exemple, il est impossible d'être à la fois tankiste et pilote. Pour le reste, les joueurs sont libres de choisir ce qui leur plaît et correspond le mieux à leur style de jeu. Le gameplay de Heroes & Generals est basé sur des sessions, et dans chaque partie, l'objectif principal est de contrôler des points stratégiques. L'élimination des ennemis n'est donc pas le but premier. Il est important de se rappeler que la capture de points est strictement limitée à une séquence précise. Cela deviendra immédiatement évident en consultant la carte. Lorsqu'une équipe capture une branche entière de points, les ennemis dans cette direction ne peuvent plus réapparaître, ce qui mène généralement à la victoire. Les zones du jeu varient non seulement en taille, mais aussi en types de véhicules disponibles. Par exemple, certaines sont exclusivement réservées à l'infanterie, d'autres aux chars, et d'autres encore plus vastes où l'on trouve même des avions. Piloter un type de véhicule spécifique requiert une classe spécifique. Ainsi, si vous jouez un tankiste, vous commencerez la partie aux commandes d'un char. Au départ, vous aurez accès à des véhicules plus simples, mais vous pourrez progressivement débloquer des modèles plus avancés. Chaque soldat dispose d'un arsenal standard, mais grâce au système de niveaux, vous pouvez débloquer de nouvelles armes et les améliorer. Le nombre d'armes est relativement faible, mais chacune possède ses propres avantages. En d'autres termes, il n'y a pratiquement pas de mauvaises armes. Outre des escarmouches ponctuelles en divers lieux, le jeu propose une carte du monde où se déroule la guerre. Ainsi, chaque joueur peut influencer le sort de sa faction et, en quelque sorte, changer le cours de l'histoire."
            },
            "GR": {
                "text": "Το Heroes & Generals είναι ένα online παιχνίδι σκοποβολής πρώτου προσώπου που αναπτύχθηκε από το δανέζικο στούντιο Reto-Moto. Το παιχνίδι έχει θέμα τον Δεύτερο Παγκόσμιο Πόλεμο. Προς το παρόν, το παιχνίδι περιλαμβάνει τρεις παρατάξεις: την ΕΣΣΔ, τη Γερμανία και τις ΗΠΑ. Ένας μόνο λογαριασμός μπορεί να παίξει ταυτόχρονα και με τις τρεις παρατάξεις και να επιλέξει τον στρατιώτη που θέλει ανά πάσα στιγμή. Στην αρχή του παιχνιδιού, μπορείτε να παίξετε μόνο ως τυπικός πεζικός, αλλά καθώς προχωράτε στις τάξεις, θα ξεκλειδωθούν αρκετές ακόμη κλάσεις: τανκ, πιλότος, αλεξιπτωτιστής (αλεξίπτωτο), ανιχνευτής (ελεύθερος σκοπευτής) και στρατηγός. Εάν ξαφνικά αποφασίσετε να αλλάξετε την κλάση πεζικού σας, θυμηθείτε ότι δεν υπάρχει επιστροφή. Αυτό σημαίνει ότι ένας στρατιώτης μπορεί να έχει μόνο μία κλάση. για παράδειγμα, δεν μπορείτε να είστε και τανκ και πιλότος. Διαφορετικά, οι παίκτες είναι ελεύθεροι να επιλέξουν τι τους αρέσει και τι ταιριάζει καλύτερα στο στυλ παιχνιδιού τους. Τρόπος παιχνιδιού: Το Heroes & Generals είναι ένα παιχνίδι σκοποβολής που βασίζεται σε συνεδρίες και σε κάθε αγώνα, ο κύριος στόχος είναι η διατήρηση σημείων ελέγχου. Δηλαδή, η θανάτωση εχθρών δεν είναι ο πρωταρχικός στόχος. Είναι σημαντικό να θυμάστε ότι η κατάκτηση πόντων περιορίζεται αυστηρά σε μια συγκεκριμένη ακολουθία. Αυτό θα γίνει αμέσως εμφανές όταν κοιτάξετε τον συνολικό χάρτη. Όταν μια ομάδα κατακτήσει έναν ολόκληρο κλάδο σημείων, οι εχθροί προς αυτήν την κατεύθυνση δεν μπορούν πλέον να αναδυθούν, κάτι που συνήθως οδηγεί σε τελική νίκη. Οι τοποθεσίες στο παιχνίδι ποικίλλουν όχι μόνο σε μέγεθος αλλά και στους τύπους οχημάτων που είναι διαθέσιμα τη δεδομένη στιγμή. Για παράδειγμα, υπάρχουν τοποθεσίες αποκλειστικά για πεζικό, τοποθεσίες με άρματα μάχης και ακόμη μεγαλύτερες τοποθεσίες όπου είναι διαθέσιμα ακόμη και αεροσκάφη. Ο έλεγχος ενός συγκεκριμένου τύπου οχήματος απαιτεί μια συγκεκριμένη κλάση. Έτσι, για παράδειγμα, αν παίζετε ως τανκ, θα ξεκινήσετε το παιχνίδι σε ένα τανκ. Αρχικά, θα έχετε πρόσβαση σε απλούστερα οχήματα, αλλά σταδιακά θα μπορείτε να ξεκλειδώσετε πιο προηγμένα. Κάθε στρατιώτης έχει ένα τυπικό σετ όπλων, αλλά μέσω του συστήματος ισοπέδωσης, μπορείτε να ξεκλειδώσετε νέα όπλα και να τα αναβαθμίσετε. Υπάρχουν σχετικά λίγα όπλα στο παιχνίδι, αλλά το καθένα έχει τα δικά του πλεονεκτήματα. Με άλλα λόγια, ουσιαστικά δεν υπάρχουν κακά όπλα. Εκτός από μικρές αψιμαχίες σε διάφορες τοποθεσίες, το παιχνίδι διαθέτει έναν παγκόσμιο χάρτη όπου λαμβάνει χώρα ο πόλεμος. Αυτό σημαίνει ότι κάθε παίκτης μπορεί να επηρεάσει την κατάσταση της παράταξής του και, ας πούμε, να αλλάξει την πορεία της ιστορίας."
            },
            "IN": {
                "text": "हीरोज़ एंड जनरल्स एक ऑनलाइन फर्स्ट-पर्सन शूटर है जिसे डेनिश स्टूडियो रेटो-मोटो ने बनाया है। गेम की थीम दूसरे विश्व युद्ध पर आधारित है। अभी, गेम में तीन ग्रुप हैं: USSR, जर्मनी और USA। एक ही अकाउंट से आप एक ही समय में तीनों ग्रुप के तौर पर खेल सकते हैं और अपनी पसंद का सैनिक कभी भी चुन सकते हैं। गेम की शुरुआत में, आप सिर्फ़ एक स्टैंडर्ड इन्फेंट्रीमैन के तौर पर खेल सकते हैं, लेकिन जैसे-जैसे आप रैंक में आगे बढ़ेंगे, कई और क्लास अनलॉक होंगी: टैंकर, पायलट, पैराट्रूपर (पैराशूट), स्काउट (स्नाइपर), और जनरल। अगर आप अचानक अपनी इन्फेंट्री क्लास बदलने का फैसला करते हैं, तो याद रखें कि आप पीछे नहीं हट सकते। इसका मतलब है कि एक सैनिक की सिर्फ़ एक ही क्लास हो सकती है; उदाहरण के लिए, आप टैंकर और पायलट दोनों नहीं हो सकते। नहीं तो, प्लेयर्स अपनी पसंद और अपने खेलने के तरीके के हिसाब से सबसे अच्छा चुनने के लिए आज़ाद हैं। गेमप्ले: हीरोज़ एंड जनरल्स एक सेशन-बेस्ड शूटर है, और हर मैच में, मुख्य मकसद कंट्रोल पॉइंट पर कब्ज़ा करना होता है। यानी, दुश्मनों को मारना मुख्य मकसद नहीं है। यह याद रखना ज़रूरी है कि पॉइंट्स पर कब्ज़ा करना एक खास सीक्वेंस तक ही सीमित है। जब आप पूरा मैप देखेंगे तो यह तुरंत साफ़ हो जाएगा। जब एक टीम पॉइंट्स की पूरी ब्रांच पर कब्ज़ा कर लेती है, तो उस दिशा में दुश्मन दोबारा नहीं आ सकते, जिससे आमतौर पर आखिर में जीत मिलती है। गेम में लोकेशन न सिर्फ़ साइज़ में बल्कि उस समय उपलब्ध गाड़ियों के टाइप में भी अलग-अलग होती हैं। उदाहरण के लिए, कुछ लोकेशन खास तौर पर पैदल सेना के लिए होती हैं, कुछ टैंक वाली लोकेशन होती हैं, और कुछ बड़ी लोकेशन भी होती हैं जहाँ एयरक्राफ्ट भी उपलब्ध होते हैं। किसी खास तरह की गाड़ी को कंट्रोल करने के लिए एक खास क्लास की ज़रूरत होती है। तो, उदाहरण के लिए, अगर आप एक टैंकर के तौर पर खेलते हैं, तो आप गेम की शुरुआत एक टैंक से करेंगे। शुरुआत में, आपके पास आसान गाड़ियों का एक्सेस होगा, लेकिन धीरे-धीरे आप ज़्यादा एडवांस्ड गाड़ियों को अनलॉक कर पाएँगे। हर सैनिक के पास हथियारों का एक स्टैंडर्ड सेट होता है, लेकिन लेवलिंग सिस्टम के ज़रिए, आप नए हथियार अनलॉक कर सकते हैं और उन्हें लेवल अप कर सकते हैं। गेम में काफ़ी कम हथियार हैं, लेकिन हर एक के अपने फ़ायदे हैं। दूसरे शब्दों में, असल में कोई भी खराब हथियार नहीं है। अलग-अलग जगहों पर छोटी-मोटी झड़पों के अलावा, गेम में एक ग्लोबल मैप है जहाँ युद्ध हो रहा है। इसका मतलब है कि हर खिलाड़ी अपने ग्रुप के हालात पर असर डाल सकता है और, एक तरह से कहें तो, इतिहास का रुख बदल सकता है।"
            },
            "IT": {
                "text": "Heroes & Generals è uno sparatutto in prima persona online sviluppato dallo studio danese Reto-Moto. Il gioco è ambientato durante la Seconda Guerra Mondiale. Attualmente, il gioco presenta tre fazioni: URSS, Germania e Stati Uniti. Un singolo account può giocare contemporaneamente con tutte e tre le fazioni e selezionare il soldato desiderato in qualsiasi momento. All'inizio del gioco, è possibile giocare solo come fante standard, ma avanzando di grado si sbloccheranno diverse classi: carrista, pilota, paracadutista (paracadutista), esploratore (cecchino) e generale. Se all'improvviso decidi di cambiare la tua classe di fanteria, ricorda che non si torna indietro. Questo significa che un soldato può avere una sola classe; ad esempio, non puoi essere sia un carrista che un pilota. Per il resto, i giocatori sono liberi di scegliere ciò che preferiscono e ciò che meglio si adatta al loro stile di gioco. Gameplay: Heroes & Generals è uno sparatutto basato su sessioni e, in ogni partita, l'obiettivo principale è mantenere i punti di controllo. Uccidere i nemici non è quindi l'obiettivo primario. È importante ricordare che la cattura dei punti è strettamente limitata a una sequenza specifica. Questo sarà immediatamente evidente osservando la mappa generale. Quando una squadra cattura un'intera serie di punti, i nemici in quella direzione non possono più rigenerarsi, il che di solito porta alla vittoria finale. Le posizioni nel gioco variano non solo per dimensioni, ma anche per tipologia di veicoli disponibili in quel momento. Ad esempio, ci sono posizioni riservate esclusivamente alla fanteria, posizioni con carri armati e posizioni ancora più grandi dove sono disponibili anche aerei. Controllare un tipo specifico di veicolo richiede una classe specifica. Quindi, ad esempio, se giochi come carrista, inizierai il gioco a bordo di un carro armato. Inizialmente, avrai accesso a veicoli più semplici, ma gradualmente potrai sbloccare quelli più avanzati. Ogni soldato ha un set di armi standard, ma attraverso il sistema di livellamento puoi sbloccare nuove armi e farle salire di livello. Ci sono relativamente poche armi nel gioco, ma ognuna ha i suoi vantaggi. In altre parole, non ci sono praticamente armi scadenti. Oltre a piccole schermaglie in varie località, il gioco presenta una mappa globale in cui si svolge la guerra. Ciò significa che ogni giocatore può influenzare lo stato delle cose della propria fazione e, per così dire, cambiare il corso della storia."
            },
            "JP": {
                "text": "Heroes & Generalsは、デンマークのスタジオReto-Motoが開発したオンライン一人称視点シューティングゲームです。第二次世界大戦をテーマとしており、現在、ソ連、ドイツ、アメリカの3つの勢力が登場します。1つのアカウントで3つの勢力すべてを同時にプレイでき、いつでも好きな兵士を選択できます。ゲーム開始時は標準歩兵としてプレイできますが、ランクが上がるにつれて、戦車兵、パイロット、空挺兵（パラシュート）、偵察兵（スナイパー）、将軍といった複数のクラスがアンロックされます。歩兵クラスを突然変更する場合、元に戻すことはできません。つまり、兵士は1つのクラスしか選択できません。例えば、戦車兵とパイロットの両方になることはできません。それ以外は、プレイヤーは自分の好きなクラス、そして自分のプレイスタイルに合ったクラスを自由に選択できます。ゲームプレイ：Heroes & Generalsはセッションベースのシューティングゲームで、各マッチの主な目的はコントロールポイントの確保です。つまり、敵を倒すことは主な目標ではありません。ポイントの占領は特定の順序に厳密に制限されていることを覚えておくことが重要です。これはマップ全体を見ればすぐに分かります。片方のチームがポイントの分岐全体を占領すると、その方向の敵はリスポーンできなくなり、通常は最終的な勝利につながります。ゲーム内のロケーションは、規模だけでなく、その時点で利用可能な車両の種類も異なります。例えば、歩兵専用のロケーション、戦車が配備されているロケーション、さらには航空機も利用可能な大規模なロケーションなどがあります。特定の種類の車両を操作するには、特定のクラスが必要です。例えば、戦車兵としてプレイする場合、ゲーム開始時は戦車に乗っています。最初は比較的シンプルな車両しか使用できませんが、徐々により高度な車両をアンロックできるようになります。各兵士は標準的な武器セットを持っていますが、レベルアップシステムを通じて新しい武器をアンロックし、レベルアップさせることができます。ゲーム内の武器の数は比較的少ないですが、それぞれに長所があります。言い換えれば、悪い武器は事実上存在しません。様々な場所で繰り広げられる小規模な小競り合いに加え、このゲームでは世界地図上で戦争が繰り広げられます。つまり、各プレイヤーは自らの勢力の情勢に影響を与え、いわば歴史の流れを変えることができるのです。"
            },
            "KP": {
                "text": "Heroes & Generals는 덴마크 개발사 Reto-Moto에서 제작한 온라인 1인칭 슈팅 게임입니다. 제2차 세계 대전을 배경으로 하며, 현재 소련, 독일, 미국 세 진영이 있습니다. 하나의 계정으로 세 진영 모두를 동시에 플레이할 수 있고, 언제든지 원하는 병과를 선택할 수 있습니다. 게임 초반에는 일반 보병만 플레이할 수 있지만, 계급이 올라갈수록 전차병, 조종사, 공수부대원, 정찰병(저격수), 장군 등 다양한 병과가 해금됩니다. 보병 병과를 변경하면 되돌릴 수 없다는 점에 유의하세요. 즉, 한 병과는 하나만 선택할 수 있습니다. 예를 들어 전차병과 조종사를 동시에 플레이할 수는 없습니다. 그 외에는 플레이어들이 자유롭게 자신의 취향과 플레이 스타일에 맞는 병과를 선택할 수 있습니다. 게임플레이: Heroes & Generals는 세션 기반 슈팅 게임으로, 각 매치의 주요 목표는 거점을 점령하는 것입니다. 즉, 적을 처치하는 것이 주된 목표는 아닙니다. 거점 점령은 정해진 순서대로만 가능하다는 점을 명심해야 합니다. 전체 지도를 보면 이 점을 바로 알 수 있습니다. 한 팀이 특정 지점의 모든 거점을 점령하면 해당 방향의 적들은 더 이상 부활할 수 없으며, 이는 결국 승리로 이어지는 경우가 많습니다. 게임 속 지역은 크기뿐만 아니라 사용 가능한 차량 종류도 다양합니다. 예를 들어 보병 전용 지역, 전차 전용 지역, 심지어 항공기까지 운용 가능한 대규모 지역도 있습니다. 특정 차량을 조종하려면 특정 병과를 선택해야 합니다. 예를 들어 전차병으로 플레이한다면 게임 시작 시 전차를 조종하게 됩니다. 처음에는 간단한 전차를 사용할 수 있지만, 점차 고급 전차를 해금할 수 있습니다. 각 병사는 기본 무기를 가지고 있지만, 레벨 시스템을 통해 새로운 무기를 해금하고 레벨업할 수 있습니다. 게임 내 무기의 종류는 비교적 적지만, 각 무기마다 고유한 장점이 있습니다. 다시 말해, 쓸모없는 무기는 거의 없습니다. 다양한 지역에서의 소규모 전투 외에도, 게임은 전쟁이 벌어지는 글로벌 맵을 제공합니다. 이는 각 플레이어가 자신의 진영 상황에 영향을 미칠 수 있고, 말하자면 역사의 흐름을 바꿀 수 있다는 것을 의미합니다."
            },
            "KR": {
                "text": "Heroes & Generals는 덴마크 개발사 Reto-Moto에서 제작한 온라인 1인칭 슈팅 게임입니다. 제2차 세계 대전을 배경으로 하며, 현재 소련, 독일, 미국 세 진영이 있습니다. 하나의 계정으로 세 진영 모두를 동시에 플레이할 수 있고, 언제든지 원하는 병과를 선택할 수 있습니다. 게임 초반에는 일반 보병만 플레이할 수 있지만, 계급이 올라갈수록 전차병, 조종사, 공수부대원, 정찰병(저격수), 장군 등 다양한 병과가 해금됩니다. 보병 병과를 변경하면 되돌릴 수 없다는 점에 유의하세요. 즉, 한 병과는 하나만 선택할 수 있습니다. 예를 들어 전차병과 조종사를 동시에 플레이할 수는 없습니다. 그 외에는 플레이어들이 자유롭게 자신의 취향과 플레이 스타일에 맞는 병과를 선택할 수 있습니다. 게임플레이: Heroes & Generals는 세션 기반 슈팅 게임으로, 각 매치의 주요 목표는 거점을 점령하는 것입니다. 즉, 적을 처치하는 것이 주된 목표는 아닙니다. 거점 점령은 정해진 순서대로만 가능하다는 점을 명심해야 합니다. 전체 지도를 보면 이 점을 바로 알 수 있습니다. 한 팀이 특정 지점의 모든 거점을 점령하면 해당 방향의 적들은 더 이상 부활할 수 없으며, 이는 결국 승리로 이어지는 경우가 많습니다. 게임 속 지역은 크기뿐만 아니라 사용 가능한 차량 종류도 다양합니다. 예를 들어 보병 전용 지역, 전차 전용 지역, 심지어 항공기까지 운용 가능한 대규모 지역도 있습니다. 특정 차량을 조종하려면 특정 병과를 선택해야 합니다. 예를 들어 전차병으로 플레이한다면 게임 시작 시 전차를 조종하게 됩니다. 처음에는 간단한 전차를 사용할 수 있지만, 점차 고급 전차를 해금할 수 있습니다. 각 병사는 기본 무기를 가지고 있지만, 레벨 시스템을 통해 새로운 무기를 해금하고 레벨업할 수 있습니다. 게임 내 무기의 종류는 비교적 적지만, 각 무기마다 고유한 장점이 있습니다. 다시 말해, 쓸모없는 무기는 거의 없습니다. 다양한 지역에서의 소규모 전투 외에도, 게임은 전쟁이 벌어지는 글로벌 맵을 제공합니다. 이는 각 플레이어가 자신의 진영 상황에 영향을 미칠 수 있고, 말하자면 역사의 흐름을 바꿀 수 있다는 것을 의미합니다."
            },
            "LK": {
                "text": "Heroes & Generals इति डेनिश-स्टूडियो रेटो-मोटो इत्यनेन विकसितः ऑनलाइन प्रथम-व्यक्ति-शूटरः अस्ति । द्वितीयविश्वयुद्धस्य परितः विषयः अयं क्रीडा अस्ति । सम्प्रति अस्मिन् क्रीडने सोवियतसङ्घः, जर्मनीदेशः, अमेरिकादेशः च इति त्रयः गुटाः सन्ति । एकः खातः युगपत् त्रयः अपि गुटाः इति क्रीडितुं शक्नोति तथा च कदापि इच्छितं सैनिकं चयनं कर्तुं शक्नोति । क्रीडायाः आरम्भे भवान् केवलं मानकपदातिसैनिकरूपेण एव क्रीडितुं शक्नोति, परन्तु यथा यथा भवान् पङ्क्तौ प्रगच्छति तथा तथा अनेकाः अधिकाः वर्गाः अनलॉक् करिष्यन्ति: टैंकर, पायलट्, पैराशूटर (पैराशूट्), स्काउट् (स्नाइपर), जनरल् च यदि भवन्तः सहसा पदातिवर्गं परिवर्तयितुं निश्चयं कुर्वन्ति तर्हि स्मर्यतां यत् पुनः गमनम् नास्ति । सैनिकस्य एकः एव वर्गः भवितुम् अर्हति इति भावः; यथा, भवन्तः टैंकरः, विमानचालकः च भवितुम् न शक्नुवन्ति। अन्यथा क्रीडकाः स्वतन्त्राः सन्ति यत् तेषां कृते किं रोचते, किं च तेषां क्रीडाशैल्याः अनुकूलं भवति । गेमप्ले : Heroes & Generals इति सत्र-आधारितः शूटरः अस्ति, प्रत्येकस्मिन् मेलने मुख्य उद्देश्यं नियन्त्रणबिन्दून् धारयितुं भवति । अर्थात् शत्रुवधः प्राथमिकं लक्ष्यं न भवति। इदं स्मर्तव्यं यत् बिन्दून् ग्रहणं विशिष्टक्रमे एव सख्यं सीमितं भवति । समग्रं मानचित्रं दृष्ट्वा तत्क्षणमेव स्पष्टं भविष्यति । यदा एकः दलः सम्पूर्णं बिन्दुशाखां गृह्णाति तदा तस्मिन् दिशि शत्रवः पुनः प्रजननं कर्तुं न शक्नुवन्ति, येन प्रायः अन्ते विजयः भवति । क्रीडायां स्थानानि न केवलं आकारेण अपितु दत्तक्षणे उपलब्धानां वाहनानां प्रकारेषु अपि भिन्नानि भवन्ति । यथा - पदातिसैनिकानाम् एव स्थानानि, टङ्कयुक्तानि स्थानानि, बृहत्तराणि अपि स्थानानि सन्ति यत्र विमानानि अपि उपलभ्यन्ते । विशिष्टप्रकारस्य वाहनस्य नियन्त्रणार्थं विशिष्टवर्गस्य आवश्यकता भवति । अतः, उदाहरणार्थं, यदि भवान् टङ्कररूपेण क्रीडति तर्हि टङ्के क्रीडां आरभेत । प्रारम्भे सरलतरवाहनानां प्रवेशः भविष्यति, परन्तु क्रमेण अधिकानि उन्नतानि वाहनानि अनलॉक् कर्तुं शक्नुथ । प्रत्येकस्य सैनिकस्य मानकशस्त्रसमूहः भवति, परन्तु समतलीकरणप्रणाल्याः माध्यमेन, भवान् नूतनानि शस्त्राणि अनलॉक् कृत्वा तान् स्तरं कर्तुं शक्नोति । क्रीडायां तुल्यकालिकरूपेण अल्पानि शस्त्राणि सन्ति, परन्तु प्रत्येकस्य स्वकीयाः लाभाः सन्ति । अन्येषु शब्देषु, दुष्टशस्त्राणि व्यावहारिकरूपेण न सन्ति । विभिन्नेषु स्थानेषु लघु-लघु-सङ्घर्षस्य अतिरिक्तं, अस्मिन् क्रीडने वैश्विक-नक्शा दृश्यते यत्र युद्धं भवति । अस्य अर्थः अस्ति यत् प्रत्येकं क्रीडकः स्वगुटस्य स्थितिं प्रभावितुं शक्नोति तथा च इतिहासस्य मार्गं परिवर्तयितुं शक्नोति ।"
            },
            "MC": {
                "text": "Heroes & Generals est un jeu de tir à la première personne en ligne développé par le studio danois Reto-Moto. Le jeu se déroule pendant la Seconde Guerre mondiale. Actuellement, il propose trois factions : l'URSS, l'Allemagne et les États-Unis. Un seul compte permet de jouer simultanément avec les trois factions et de choisir son soldat à tout moment. Au début, vous ne pouvez incarner qu'un simple fantassin, mais en progressant dans la hiérarchie, plusieurs classes supplémentaires se débloquent : tankiste, pilote, parachutiste, éclaireur (tireur d'élite) et général. Attention : si vous changez de classe, il est impossible de revenir en arrière. Un soldat ne peut donc appartenir qu'à une seule classe ; par exemple, il est impossible d'être à la fois tankiste et pilote. Pour le reste, les joueurs sont libres de choisir ce qui leur plaît et correspond le mieux à leur style de jeu. Le gameplay de Heroes & Generals est basé sur des sessions, et dans chaque partie, l'objectif principal est de contrôler des points stratégiques. L'élimination des ennemis n'est donc pas le but premier. Il est important de se rappeler que la capture de points est strictement limitée à une séquence précise. Cela deviendra immédiatement évident en consultant la carte. Lorsqu'une équipe capture une branche entière de points, les ennemis dans cette direction ne peuvent plus réapparaître, ce qui mène généralement à la victoire. Les zones du jeu varient non seulement en taille, mais aussi en types de véhicules disponibles. Par exemple, certaines sont exclusivement réservées à l'infanterie, d'autres aux chars, et d'autres encore plus vastes où l'on trouve même des avions. Piloter un type de véhicule spécifique requiert une classe spécifique. Ainsi, si vous jouez un tankiste, vous commencerez la partie aux commandes d'un char. Au départ, vous aurez accès à des véhicules plus simples, mais vous pourrez progressivement débloquer des modèles plus avancés. Chaque soldat dispose d'un arsenal standard, mais grâce au système de niveaux, vous pouvez débloquer de nouvelles armes et les améliorer. Le nombre d'armes est relativement faible, mais chacune possède ses propres avantages. En d'autres termes, il n'y a pratiquement pas de mauvaises armes. Outre des escarmouches ponctuelles en divers lieux, le jeu propose une carte du monde où se déroule la guerre. Ainsi, chaque joueur peut influencer le sort de sa faction et, en quelque sorte, changer le cours de l'histoire."
            },
            "MD": {
                "text": "Heroes & Generals este un shooter online la persoana întâi dezvoltat de studioul danez Reto-Moto. Jocul este axat pe cel de-al Doilea Război Mondial. În prezent, jocul prezintă trei facțiuni: URSS, Germania și SUA. Un singur cont poate juca simultan cu toate cele trei facțiuni și poate selecta soldatul dorit în orice moment. La începutul jocului, poți juca doar ca infanterist standard, dar pe măsură ce avansezi în grad, se vor debloca mai multe clase: tanchist, pilot, parașutist (parașută), cercetaș (lunetist) și general. Dacă te decizi brusc să-ți schimbi clasa de infanterie, amintește-ți că nu există cale de întoarcere. Aceasta înseamnă că un soldat poate avea o singură clasă; de exemplu, nu poți fi atât tanchist, cât și pilot. În caz contrar, jucătorii sunt liberi să aleagă ce le place și ce se potrivește cel mai bine stilului lor de joc. Gameplay: Heroes & Generals este un shooter bazat pe sesiuni, iar în fiecare meci, obiectivul principal este de a deține puncte de control. Adică, uciderea inamicilor nu este scopul principal. Este important să ne amintim că capturarea punctelor este strict limitată la o secvență specifică. Acest lucru va deveni imediat evident atunci când te uiți la harta generală. Când o echipă capturează o întreagă ramură de puncte, inamicii din acea direcție nu mai pot reapărea, ceea ce duce de obicei la o victorie finală. Locațiile din joc variază nu numai ca dimensiune, ci și ca tipuri de vehicule disponibile la momentul dat. De exemplu, există locații exclusiv pentru infanterie, locații cu tancuri și locații chiar mai mari unde sunt disponibile chiar și aeronave. Controlul unui anumit tip de vehicul necesită o clasă specifică. Așadar, de exemplu, dacă joci ca tanc, vei începe jocul într-un tanc. Inițial, vei avea acces la vehicule mai simple, dar treptat vei putea debloca altele mai avansate. Fiecare soldat are un set standard de arme, dar prin sistemul de nivelare, poți debloca arme noi și le poți crește în nivel. Există relativ puține arme în joc, dar fiecare are propriile avantaje. Cu alte cuvinte, practic nu există arme proaste. Pe lângă mici încăierări în diverse locații, jocul prezintă o hartă globală în care are loc războiul. Asta înseamnă că fiecare jucător poate influența starea de fapt a facțiunii sale și, ca să spunem așa, poate schimba cursul istoriei."
            },
            "MK": {
                "text": "Heroes & Generals е онлајн пукачка игра од прво лице развиена од данското студио Reto-Moto. Играта е тематски ориентирана кон Втората светска војна. Моментално, играта има три фракции: СССР, Германија и САД. Една сметка може истовремено да игра како сите три фракции и да го избере војникот што го сакате во секое време. На почетокот на играта, можете да играте само како стандарден пешадиец, но како што напредувате низ редовите, ќе се отклучат уште неколку класи: танкер, пилот, падобранец (падобран), извидник (снајперист) и генерал. Ако одеднаш одлучите да ја промените вашата пешадиска класа, запомнете дека нема враќање назад. Ова значи дека војникот може да има само една класа; на пример, не можете да бидете и танкер и пилот. Во спротивно, играчите се слободни да изберат што сакаат и што најмногу им одговара на нивниот стил на игра. Игра: Heroes & Generals е пукачка игра базирана на сесии, и во секој натпревар, главната цел е да се држат контролни точки. Тоа е, убивањето непријатели не е примарна цел. Важно е да се запомни дека освојувањето поени е строго ограничено на одредена секвенца. Ова веднаш ќе стане очигледно кога ќе ја погледнете целокупната мапа. Кога еден тим ќе освои цела гранка од точки, непријателите во таа насока повеќе не можат да се појават повторно, што обично води до евентуална победа. Локациите во играта варираат не само по големина, туку и по видовите возила достапни во дадениот момент. На пример, постојат локации исклучиво за пешадија, локации со тенкови, па дури и поголеми локации каде што се достапни дури и авиони. Контролирањето на одреден тип на возило бара одредена класа. На пример, ако играте како танкер, ќе ја започнете играта во тенк. Првично, ќе имате пристап до поедноставни возила, но постепено ќе можете да отклучите понапредни. Секој војник има стандарден сет на оружје, но преку системот за нивелирање, можете да отклучите ново оружје и да го подигнете нивото. Во играта има релативно малку оружја, но секое има свои предности. Со други зборови, практично нема лошо оружје. Покрај малите престрелки на различни локации, играта има глобална мапа каде што се одвива војната. Ова значи дека секој играч може да влијае на состојбата на својата фракција и, така да се каже, да го промени текот на историјата."
            },
            "MX": {
                "text": "Heroes & Generals es un juego de disparos en primera persona online desarrollado por el estudio danés Reto-Moto. La temática del juego gira en torno a la Segunda Guerra Mundial. Actualmente, cuenta con tres facciones: la URSS, Alemania y EE. UU. Una sola cuenta puede jugar simultáneamente con las tres facciones y seleccionar el soldado que desee en cualquier momento. Al principio, solo puedes jugar como soldado de infantería estándar, pero a medida que subes de rango, se desbloquearán varias clases más: tanquista, piloto, paracaidista, explorador y general. Si decides cambiar de clase de infantería repentinamente, recuerda que no hay vuelta atrás. Esto significa que un soldado solo puede tener una clase; por ejemplo, no puedes ser tanquista y piloto a la vez. De lo contrario, los jugadores son libres de elegir lo que prefieran y se adapte mejor a su estilo de juego. Jugabilidad: Heroes & Generals es un juego de disparos por sesiones, y en cada partida, el objetivo principal es mantener los puntos de control. Es decir, matar enemigos no es el objetivo principal. Es importante recordar que la captura de puntos está estrictamente limitada a una secuencia específica. Esto se hará evidente al observar el mapa general. Cuando un equipo captura una rama completa de puntos, los enemigos en esa dirección ya no pueden reaparecer, lo que generalmente conduce a la victoria. Las ubicaciones del juego varían no solo en tamaño, sino también en los tipos de vehículos disponibles en cada momento. Por ejemplo, hay ubicaciones exclusivas para infantería, ubicaciones con tanques e incluso ubicaciones más grandes donde incluso hay aviones disponibles. Controlar un tipo específico de vehículo requiere una clase específica. Por ejemplo, si juegas como tanquista, comenzarás la partida en un tanque. Inicialmente, tendrás acceso a vehículos más sencillos, pero gradualmente podrás desbloquear vehículos más avanzados. Cada soldado tiene un conjunto de armas estándar, pero mediante el sistema de niveles, puedes desbloquear nuevas armas y subirlas de nivel. Hay relativamente pocas armas en el juego, pero cada una tiene sus propias ventajas. En otras palabras, prácticamente no hay armas malas. Además de pequeñas escaramuzas en diversos lugares, el juego cuenta con un mapa global donde se desarrolla la guerra. Esto significa que cada jugador puede influir en la situación de su facción y, por así decirlo, cambiar el curso de la historia."
            },
            "PT": {
                "text": "Heroes & Generals é um jogo de tiro na primeira pessoa online desenvolvido pelo estúdio dinamarquês Reto-Moto. O jogo é ambientado na Segunda Guerra Mundial. Atualmente, o jogo apresenta três fações: URSS, Alemanha e EUA. Uma única conta pode jogar simultaneamente com as três facções e seleccionar o soldado que desejar a qualquer momento. No início do jogo, só pode jogar como soldado de infantaria padrão, mas à medida que avança nas patentes, várias outras classes serão desbloqueadas: tanqueiro, piloto, paraquedista, batedor (atirador de elite) e general. Se decidir mudar de classe de infantaria, lembre-se que não há volta a dar. Isto significa que um soldado só pode ter uma classe; por exemplo, não se pode ser tanqueiro e piloto ao mesmo tempo. Fora isso, os jogadores são livres de escolher o que gostam e o que melhor se adapta ao seu estilo de jogo. Jogabilidade: Heroes & Generals é um jogo de tiros baseado em sessões, e em cada partida, o principal objetivo é manter pontos de controlo. Ou seja, matar inimigos não é o objetivo principal. É importante lembrar que a captura de pontos está estritamente limitada a uma sequência específica. Isto será imediatamente evidente ao observar o mapa geral. Quando uma equipa captura um conjunto inteiro de pontos, os inimigos nessa direção já não podem reaparecer, o que geralmente leva à vitória. Os locais no jogo variam não só em tamanho, mas também nos tipos de veículos disponíveis num determinado momento. Por exemplo, existem locais exclusivos para infantaria, locais com tanques e locais ainda maiores onde até aeronaves estão disponíveis. Controlar um tipo específico de veículo requer uma classe específica. Assim, por exemplo, se jogar como tanqueiro, começará o jogo num tanque. Inicialmente, terá acesso a veículos mais simples, mas gradualmente poderá desbloquear veículos mais avançados. Cada soldado possui um conjunto padrão de armas, mas através do sistema de níveis, pode desbloquear novas armas e melhorá-las. Existem relativamente poucas armas no jogo, mas cada uma tem as suas próprias vantagens. Por outras palavras, praticamente não existem armas más. Para além de pequenas escaramuças em vários locais, o jogo apresenta um mapa global onde a guerra está a decorrer. Isto significa que cada jogador pode influenciar a situação da sua fação e, por assim dizer, mudar o curso da história."
            },
            "RO": {
                "text": "Heroes & Generals este un shooter online la persoana întâi dezvoltat de studioul danez Reto-Moto. Jocul este axat pe cel de-al Doilea Război Mondial. În prezent, jocul prezintă trei facțiuni: URSS, Germania și SUA. Un singur cont poate juca simultan cu toate cele trei facțiuni și poate selecta soldatul dorit în orice moment. La începutul jocului, poți juca doar ca infanterist standard, dar pe măsură ce avansezi în grad, se vor debloca mai multe clase: tanchist, pilot, parașutist (parașută), cercetaș (lunetist) și general. Dacă te decizi brusc să-ți schimbi clasa de infanterie, amintește-ți că nu există cale de întoarcere. Aceasta înseamnă că un soldat poate avea o singură clasă; de exemplu, nu poți fi atât tanchist, cât și pilot. În caz contrar, jucătorii sunt liberi să aleagă ce le place și ce se potrivește cel mai bine stilului lor de joc. Gameplay: Heroes & Generals este un shooter bazat pe sesiuni, iar în fiecare meci, obiectivul principal este de a deține puncte de control. Adică, uciderea inamicilor nu este scopul principal. Este important să ne amintim că capturarea punctelor este strict limitată la o secvență specifică. Acest lucru va deveni imediat evident atunci când te uiți la harta generală. Când o echipă capturează o întreagă ramură de puncte, inamicii din acea direcție nu mai pot reapărea, ceea ce duce de obicei la o victorie finală. Locațiile din joc variază nu numai ca dimensiune, ci și ca tipuri de vehicule disponibile la momentul dat. De exemplu, există locații exclusiv pentru infanterie, locații cu tancuri și locații chiar mai mari unde sunt disponibile chiar și aeronave. Controlul unui anumit tip de vehicul necesită o clasă specifică. Așadar, de exemplu, dacă joci ca tanc, vei începe jocul într-un tanc. Inițial, vei avea acces la vehicule mai simple, dar treptat vei putea debloca altele mai avansate. Fiecare soldat are un set standard de arme, dar prin sistemul de nivelare, poți debloca arme noi și le poți crește în nivel. Există relativ puține arme în joc, dar fiecare are propriile avantaje. Cu alte cuvinte, practic nu există arme proaste. Pe lângă mici încăierări în diverse locații, jocul prezintă o hartă globală în care are loc războiul. Asta înseamnă că fiecare jucător poate influența starea de fapt a facțiunii sale și, ca să spunem așa, poate schimba cursul istoriei."
            },
            "RS": {
                "text": "Хероји и генерали (Heroes & Generals) је онлајн пуцачина из првог лица коју је развио дански студио Reto-Moto. Игра је тематски посвећена Другом светском рату. Тренутно, игра садржи три фракције: СССР, Немачку и САД. Један налог може истовремено да игра за све три фракције и да изабере војника кога жели у било ком тренутку. На почетку игре можете играти само као стандардни пешадинац, али како напредујете кроз рангове, откључаће се још неколико класа: танкиста, пилота, падобранца (падобранац), извиђача (снајпериста) и генерала. Ако изненада одлучите да промените своју пешадијску класу, запамтите да нема повратка. То значи да војник може имати само једну класу; на пример, не можете бити и танкиста и пилот. У супротном, играчи су слободни да бирају шта им се свиђа и шта најбоље одговара њиховом стилу игре. Играње: Хероји и генерали је пуцачина заснована на сесијама, и у свакој утакмици главни циљ је држање контролних тачака. То јест, убијање непријатеља није примарни циљ. Важно је запамтити да је освајање тачака строго ограничено на одређени редослед. Ово ће одмах постати очигледно када погледате целу мапу. Када један тим освоји целу грану тачака, непријатељи у том правцу се више не могу поново појавити, што обично доводи до коначне победе. Локације у игри се разликују не само по величини већ и по врстама возила доступних у датом тренутку. На пример, постоје локације искључиво за пешадију, локације са тенковима, па чак и веће локације где су доступни чак и авиони. Контролисање одређеног типа возила захтева одређену класу. Тако, на пример, ако играте као тенкист, почећете игру у тенку. У почетку ћете имати приступ једноставнијим возилима, али ћете постепено моћи да откључате напреднија. Сваки војник има стандардни сет оружја, али кроз систем нивоа можете откључати ново оружје и подићи га на виши ниво. У игри има релативно мало оружја, али свако има своје предности. Другим речима, практично нема лошег оружја. Поред мањих окршаја на разним локацијама, игра садржи глобалну мапу где се рат одвија. То значи да сваки играч може утицати на стање ствари своје фракције и, такорећи, променити ток историје."
            },
            "RU": {
                "text": "Heroes & Generals — это онлайн игра в жанре шутера от первого лица, разработанная датской студией Reto-Moto. Тематикой игры является Вторая мировая война. На текущий момент в игре представлены 3 стороны: СССР, Германия и США. На одном аккаунте одновременно можно развивать все 3 стороны и в любой момент выбирать нужного вам солдата. В самом начале игры можно будет играть только за обычного пехотинца, но продвигаясь по карьерной лестнице, откроются еще несколько классов: танкист, лётчик, десантник (парашютист), разведчик (снайпер) и генерал. Если вы вдруг решите сменить класс пехотинца, то нужно помнить о том, что пути назад уже не будет. То есть один солдат может иметь только один класс и нельзя быть одновременно например танкистом и летчиком. В остальном же игрок волен выбирать то, что ему нравится и что лучше всего подходит под его стиль игры. Игровой процесс. Heroes & Generals является сессионным шутером и в каждом из матчей основной задачей является удержание контрольных точек. То есть убийство врагов не стоит на первом месте. При этом нужно учитывать, что захватывать точки можно в строгой последовательности. Это вы сразу поймете, когда обратите внимание на общую карту. Когда одна из команд захватывает целую ветку из точек, то в этом направлении враги уже не смогут воскрешаться и обычно это постепенно приводит к победе. Локации в игре различаются не только по размеру, но и по тому, какой вид техники доступен в данный момент. Есть например локации только для пехоты, есть локации с танками, а есть большие локации, где доступны даже самолеты. Для управления определенным видом техники потребуется специальный класс. То есть, например играя за танкиста вы будете начинать игру на танке. Сначала будут доступны простые виды техники, но постепенно можно будет открыть более серьезные виды машин. У каждого бойца есть стандартный набор оружия, но за счет системы прокачки можно открыть новые виды оружия, а также их прокачать. В игре сравнительно немного оружия, но каждое имеет свои положительные качества. То есть плохого оружия практически нет. Помимо небольших стычек на различных локациях, в игре есть глобальная карта, где идет война. То есть каждый игрок может влиять на положение дел своей фракции и так сказать поменять ход истории."
            },
            "SM": {
                "text": "Heroes & Generals è uno sparatutto in prima persona online sviluppato dallo studio danese Reto-Moto. Il gioco è ambientato durante la Seconda Guerra Mondiale. Attualmente, il gioco presenta tre fazioni: URSS, Germania e Stati Uniti. Un singolo account può giocare contemporaneamente con tutte e tre le fazioni e selezionare il soldato desiderato in qualsiasi momento. All'inizio del gioco, è possibile giocare solo come fante standard, ma avanzando di grado si sbloccheranno diverse classi: carrista, pilota, paracadutista (paracadutista), esploratore (cecchino) e generale. Se all'improvviso decidi di cambiare la tua classe di fanteria, ricorda che non si torna indietro. Questo significa che un soldato può avere una sola classe; ad esempio, non puoi essere sia un carrista che un pilota. Per il resto, i giocatori sono liberi di scegliere ciò che preferiscono e ciò che meglio si adatta al loro stile di gioco. Gameplay: Heroes & Generals è uno sparatutto basato su sessioni e, in ogni partita, l'obiettivo principale è mantenere i punti di controllo. Uccidere i nemici non è quindi l'obiettivo primario. È importante ricordare che la cattura dei punti è strettamente limitata a una sequenza specifica. Questo sarà immediatamente evidente osservando la mappa generale. Quando una squadra cattura un'intera serie di punti, i nemici in quella direzione non possono più rigenerarsi, il che di solito porta alla vittoria finale. Le posizioni nel gioco variano non solo per dimensioni, ma anche per tipologia di veicoli disponibili in quel momento. Ad esempio, ci sono posizioni riservate esclusivamente alla fanteria, posizioni con carri armati e posizioni ancora più grandi dove sono disponibili anche aerei. Controllare un tipo specifico di veicolo richiede una classe specifica. Quindi, ad esempio, se giochi come carrista, inizierai il gioco a bordo di un carro armato. Inizialmente, avrai accesso a veicoli più semplici, ma gradualmente potrai sbloccare quelli più avanzati. Ogni soldato ha un set di armi standard, ma attraverso il sistema di livellamento puoi sbloccare nuove armi e farle salire di livello. Ci sono relativamente poche armi nel gioco, ma ognuna ha i suoi vantaggi. In altre parole, non ci sono praticamente armi scadenti. Oltre a piccole schermaglie in varie località, il gioco presenta una mappa globale in cui si svolge la guerra. Ciò significa che ogni giocatore può influenzare lo stato delle cose della propria fazione e, per così dire, cambiare il corso della storia."
            },
            "TR": {
                "text": "Heroes & Generals, Danimarkalı stüdyo Reto-Moto tarafından geliştirilen çevrimiçi bir birinci şahıs nişancı oyunudur. Oyun, II. Dünya Savaşı temalıdır. Şu anda oyunda üç taraf bulunmaktadır: SSCB, Almanya ve ABD. Tek bir hesap, aynı anda üç tarafın tamamını oynayabilir ve istediğiniz askeri istediğiniz zaman seçebilirsiniz. Oyunun başında sadece standart bir piyade olarak oynayabilirsiniz, ancak rütbelerde ilerledikçe birkaç sınıf daha açılacaktır: tankçı, pilot, paraşütçü, keskin nişancı ve general. Aniden piyade sınıfınızı değiştirmeye karar verirseniz, geri dönüş olmadığını unutmayın. Bu, bir askerin yalnızca bir sınıfa sahip olabileceği anlamına gelir; örneğin, hem tankçı hem de pilot olamazsınız. Bunun dışında, oyuncular istediklerini ve oyun tarzlarına en uygun olanı seçmekte özgürdürler. Oynanış: Heroes & Generals, oturum tabanlı bir nişancı oyunudur ve her maçta ana amaç kontrol noktalarını ele geçirmektir. Yani, düşmanları öldürmek birincil amaç değildir. Unutulmaması gereken önemli bir nokta, noktaları ele geçirmenin belirli bir sırayla sınırlı olmasıdır. Bu, genel haritaya baktığınızda hemen anlaşılacaktır. Bir takım bir nokta grubunun tamamını ele geçirdiğinde, o yöndeki düşmanlar artık yeniden doğamaz, bu da genellikle nihai zafere yol açar. Oyundaki konumlar sadece boyut olarak değil, aynı zamanda o anda mevcut olan araç türleri açısından da çeşitlilik gösterir. Örneğin, yalnızca piyadeler için olan konumlar, tankların bulunduğu konumlar ve hatta uçakların bile bulunduğu daha büyük konumlar vardır. Belirli bir araç türünü kontrol etmek belirli bir sınıf gerektirir. Yani, örneğin, bir tankçı olarak oynarsanız, oyuna bir tankla başlarsınız. Başlangıçta daha basit araçlara erişiminiz olacak, ancak kademeli olarak daha gelişmiş araçların kilidini açabileceksiniz. Her askerin standart bir silah seti vardır, ancak seviye sistemi sayesinde yeni silahların kilidini açabilir ve seviyelerini yükseltebilirsiniz. Oyunda nispeten az sayıda silah vardır, ancak her birinin kendi avantajları vardır. Başka bir deyişle, neredeyse hiç kötü silah yoktur. Oyunda çeşitli yerlerdeki küçük çatışmalara ek olarak, savaşın gerçekleştiği küresel bir harita da bulunuyor. Bu, her oyuncunun kendi grubunun durumunu etkileyebileceği ve tabiri caizse tarihin seyrini değiştirebileceği anlamına geliyor."
            },
            "TW": {
                "text": "《英雄與將軍》（Heroes & Generals）是一款由丹麥工作室Reto-Moto開發的線上第一人稱射擊遊戲，以二戰為背景。目前，遊戲包含蘇聯、德國和美國三個陣營。一個帳號可以同時扮演所有三個陣營，並隨時選擇自己喜歡的士兵。遊戲初期，玩家只能扮演普通步兵，但隨著等級提升，可以解鎖更多兵種：戰車兵、飛行員、傘兵、偵察兵（狙擊手）和將軍。如果您突然決定更換步兵兵種，請記住無法更改。這意味著一名士兵只能選擇一個兵種；例如，您不能同時是坦克兵和飛行員。除此之外，玩家可以自由選擇自己喜歡且最適合自己遊戲風格的兵種。遊戲玩法：《英雄與將軍》是一款基於回合製的射擊遊戲，每場比賽的主要目標是佔領控制點。也就是說，擊殺敵人並非首要目標。務必記住，佔領據點必須嚴格按照特定順序進行。查看總地圖後，這一點會立刻顯現出來。當一方佔領一整條據點帶後，該方向的敵人將無法重生，這通常意味著最終的勝利。遊戲中的地點不僅大小各異，可用的載具類型也多種多樣。例如，有些地點僅限步兵使用，有些地點配備坦克，甚至有更大的地點可以駕駛飛機。操控特定類型的載具需要特定的職業。例如，如果你選擇坦克兵職業，遊戲開始時你將駕駛坦克。初期你只能使用較簡單的載具，但隨著遊戲進程，你將逐步解鎖更高級的載具。每位士兵都配備一套標準武器，但透過升級系統，你可以解鎖新武器並提升其等級。遊戲中的武器種類相對較少，但每種武器都有其獨特的優勢。換句話說，遊戲中幾乎沒有不好的武器。除了在各地發生的零星衝突外，遊戲還包含一張全球地圖，戰爭就發生在這張地圖上。這意味著每位玩家都可以影響自己陣營的局勢，並且可以說，改變歷史的進程。"
            },
            "UA": {
                "text": "Heroes & Generals - це онлайн гра в жанрі шутера від першої особи, розроблена датською студією Reto-Moto. Тематикою гри є Друга світова війна. На даний момент у грі представлені 3 сторони: СРСР, Німеччина та США. На одному акаунті одночасно можна розвивати всі 3 сторони і будь-якої миті вибирати потрібного вам солдата. На самому початку гри можна буде грати лише за звичайного піхотинця, але просуваючись кар'єрними сходами, відкриються ще кілька класів: танкіст, льотчик, десантник (парашутист), розвідник (снайпер) та генерал. Якщо ви раптом вирішите змінити клас піхотинця, потрібно пам'ятати про те, що шляху назад вже не буде. Тобто один солдат може мати лише один клас і не можна бути одночасно наприклад танкістом і льотчиком. В іншому ж гравець може вибирати те, що йому подобається і що найкраще підходить під його стиль гри. Ігровий процес. Heroes & Generals є сесійним шутером і в кожному з матчів основним завданням є утримання контрольних точок. Тобто вбивство ворогів не стоїть на першому місці. При цьому потрібно враховувати, що захоплювати точки можна в суворій послідовності. Це ви одразу зрозумієте, коли звернете увагу на загальну картку. Коли одна з команд захоплює цілу гілку з точок, то в цьому напрямку вороги вже не зможуть воскресати і зазвичай це поступово призводить до перемоги. Локації у грі різняться як за розміром, а й у тому, який вид техніки доступний нині. Є, наприклад, локації тільки для піхоти, є локації з танками, а є великі локації, де доступні навіть літаки. Для керування певним видом техніки знадобиться спеціальний клас. Тобто, наприклад, граючи за танкіста ви починатимете гру на танку. Спочатку будуть доступні прості види техніки, але поступово можна буде відкрити серйозніші види машин. Кожен бійець має стандартний набір зброї, але за рахунок системи прокачування можна відкрити нові види зброї, а також їх прокачати. У грі порівняно небагато зброї, але кожна має свої позитивні якості. Тобто поганої зброї практично немає. Окрім невеликих сутичок на різних локаціях, у грі є глобальна карта, де йде війна. Тобто кожен гравець може впливати на стан справ своєї фракції і змінити хід історії."
            }
        },
        "text": "Heroes & Generals is an online first-person shooter developed by the Danish studio Reto-Moto. The game is themed around World War II. Currently, the game features three factions: the USSR, Germany, and the USA. A single account can simultaneously play as all three factions and select the soldier you want at any time. At the beginning of the game, you can only play as a standard infantryman, but as you progress through the ranks, several more classes will unlock: tanker, pilot, paratrooper (parachute), scout (sniper), and general. If you suddenly decide to change your infantry class, remember that there is no going back. This means that a soldier can only have one class; for example, you can't be both a tanker and a pilot. Otherwise, players are free to choose what they like and what best suits their playstyle. Gameplay: Heroes & Generals is a session-based shooter, and in each match, the main objective is to hold control points. That is, killing enemies isn't the primary goal. It's important to remember that capturing points is strictly limited to a specific sequence. This will become immediately apparent when you look at the overall map. When one team captures an entire branch of points, enemies in that direction can no longer respawn, which usually leads to eventual victory. Locations in the game vary not only in size but also in the types of vehicles available at the given moment. For example, there are locations exclusively for infantry, locations with tanks, and even larger locations where even aircraft are available. Controlling a specific type of vehicle requires a specific class. So, for example, if you play as a tanker, you'll start the game in a tank. Initially, you'll have access to simpler vehicles, but gradually you'll be able to unlock more advanced ones. Each soldier has a standard set of weapons, but through the leveling system, you can unlock new weapons and level them up. There are relatively few weapons in the game, but each has its own advantages. In other words, there are practically no bad weapons. In addition to small skirmishes in various locations, the game features a global map where the war is taking place. This means that each player can influence the state of affairs of their faction and, so to speak, change the course of history.",
        "title": "Heroes & Generals"
    }
}